app/controllers/api/servers_controller.rb

    def index
        @servers = User.find_by_id(params[:user_id]).joined_servers
---
SELECT "servers".* FROM "servers" INNER JOIN "user_servers" ON "servers"."id" = "user_servers"."server_id" WHERE "user_servers"."user_id" = $1  [["user_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def show
        @server = Server.find_by_id(params[:id])
---
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def create
        @server = Server.new(server_params)

        if @server.save
            UserServer.create(
                server_id: @server.id,
                user_id: @server.owner_id
            )
---
INSERT INTO "servers" ("name", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "IsoVoyd's Server"], ["owner_id", 2], ["created_at", "2021-02-18 18:29:32.994087"], ["updated_at", "2021-02-18 18:29:32.994087"]]
INSERT INTO "user_servers" ("server_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["server_id", 13], ["user_id", 2], ["created_at", "2021-02-18 18:29:33.028567"], ["updated_at", "2021-02-18 18:29:33.028567"]]

    def update
        @server = Server.find_by_id(params[:id])
---
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

    def destroy
        @server = Server.find_by_id(params[:id])

        if @server
            @server.delete
---
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "servers" WHERE "servers"."id" = $1  [["id", 2]]