app/controllers/api/user_servers_controller.rb

SELECT  "servers".* FROM "servers" WHERE "servers"."invite" = $1 LIMIT $2  [["invite", "kx0ojBR8"], ["LIMIT", 1]]
INSERT INTO "user_servers" ("server_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["server_id", 6], ["user_id", 2], ["created_at", "2021-02-19 01:01:18.492509"], ["updated_at", "2021-02-19 01:01:18.492509"]]
---
    def create
        user_id = params[:join_info][:user_id]
        invite = params[:join_info][:invite]

        @user_server = UserServer.new(
            user_id: user_id,
            server_id: Server.find_by(invite: invite).id
        )

        if @user_server.save

SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def destroy
        @server = Server.find_by_id(params[:leaveInfo][:server_id])