app/models/server.rb

    def create_invite
        begin
            self[:invite] = SecureRandom.urlsafe_base64 6
        end while Server.exists?(:invite => self[:invite])
---
SELECT  1 AS one FROM "servers" WHERE "servers"."invite" = $1 LIMIT $2  [["invite", "xjNNey8H"], ["LIMIT", 1]]