app/views/api/servers/show.json.jbuilder

INSERT INTO "servers" ("name", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "IsoVoyd's Server"], ["owner_id", 2], ["created_at", "2021-02-18 18:29:32.994087"], ["updated_at", "2021-02-18 18:29:32.994087"]]
SELECT "users".* FROM "users" INNER JOIN "user_servers" ON "users"."id" = "user_servers"."user_id" WHERE "user_servers"."server_id" = $1  [["server_id", 13]]
---
    user_ids = []
    @server.users.each { |user| user_ids << user.id }